Friends | List of all members
ACAPI::MEP::RigidSegmentDefault Class Referencefinal
MEP Element Manager
The RigidSegmentDefault contains the necessary non-geometric data for creating a RigidSegment element. More...
#include <MEPRigidSegmentDefault.hpp>
 Inheritance diagram for ACAPI::MEP::RigidSegmentDefault:
 Friends
 class  | ACAPI::Impl::ObjectCreator
 class  | RigidSegmentUIManager
Result< RigidSegmentDefault >  | CreateRigidSegmentDefault (Domain domain)
Creates a RigidSegmentDefault.
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
Result< Domain >  | GetDomainOfPort (uint32_t portIndex) const
Result< VentilationPortDefault >  | GetVentilationPortDefault (uint32_t portIndex) const
Result< PipingPortDefault >  | GetPipingPortDefault (uint32_t portIndex) const
Result< CableCarrierPortDefault >  | GetCableCarrierPortDefault (uint32_t portIndex) const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
API_ElemType  | GetElemType () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions inherited from ACAPI::MEP::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Constructs an ElementDefault with the given element default implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The RigidSegmentDefault contains the necessary non-geometric data for creating a RigidSegment element.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at RoutingElementDefault and RoutingSegmentDefault
Friends And Related Symbol Documentation
◆ CreateRigidSegmentDefault
 Result< RigidSegmentDefault > CreateRigidSegmentDefault  |  ( |  Domain |  domain | )
friend
Creates a RigidSegmentDefault.
Parameters
domain | The Domain of the requested RigidSegmentDefault.
Returns
If able, returns a copy of Archicad's current Default of the RigidSegment from the RoutingElement tool for the domain defined by the parameter, otherwise Error.